        BOOT_LOAD   equ     0x7c00          ;ブートプログラムのロード位置
        ORG     BOOT_LOAD                   ;ロードアドレスをアセンブラに指示

;**************************************************************************
;   マクロ
;**************************************************************************
%include    "../include/macro.s"

;**************************************************************************
;   エントリポイント
;**************************************************************************
entry:
        ;-----------------------------------
        ;    BPB(BIOS Parameter Block)
        ;-----------------------------------
        jmp     ipl                         ; IPLへジャンプ
        times   90 - ($ - $$)   db  0x90    ;

        ;-----------------------------------
        ;   IPL(Initial Program Loader)
        ;-----------------------------------

ipl:
        cli                                 ;割り込み禁止

        mov     ax,0x0000                   ;AX = 0x0000;
        mov     ds,ax                       ;DS = 0x0000;
        mov     es,ax                       ;ES = 0x0000;
        mov     ss,ax                       ;SS = 0x0000;
        mov     sp,BOOT_LOAD                ;SP = 0x7c00;

        sti                                 ;割り込み許可;

        mov     [BOOT.DRIVE],dl             ;ブートドライブを保存

        ;-----------------------------------
        ;   文字列を表示
        ;-----------------------------------
        cdecl   puts, .s0                   ; puts(.s0);