itoa:
        ;--------------------------------------------
        ;   【スタックフレームの構築】
        ;--------------------------------------------
                                                    ;    +12 | フラグ
                                                    ;    +10 | 基数
                                                    ;    +8  | バッファサイズ
                                                    ;    +6  | バッファアドレス
                                                    ;    +2  | IP(戻り番地)
        push    bp                                  ; BP +0  | BP(元の値)
        mov     bp,sp                               ;--------+----------------

        ;-------------------------------------------
        ;   【レジスタの保存】
        ;-------------------------------------------
        push    ax
        push    bx
        push    cx
        push    dx
        push    si
        push    di

        ;------------------------------------------
        ;   引数を取得
        ;------------------------------------------
        mov     ax,[bp + 4]
        mov     si,[bp + 6]
        mov     cx,[bp + 8]

        mov     di,si
        add     di,cx
        dec     di
        mov     bx,word[bp + 12]
